In [1]:
import pandas as pd

In [2]:
pd.DataFrame([[1,2,3], [4,5,6]]) # basic syntax for writing dataframe

   0  1  2
0  1  2  3
1  4  5  6

In [3]:
a = pd.DataFrame([[1,2,3,4,5], [21,12,14,53,23], [43,5,75,45,34], [40,20,10,60,30], [2,43,12,65,99]])

In [4]:
a.head(3) # will gives us head elements

    0   1   2   3   4
0   1   2   3   4   5
1  21  12  14  53  23
2  43   5  75  45  34

In [5]:
a.tail(3) # for getting elements at end position

    0   1   2   3   4
2  43   5  75  45  34
3  40  20  10  60  30
4   2  43  12  65  99

In [6]:
b = pd.DataFrame([[1,2,3,4,5], [21,12,14,53,23], [43,5,75,45,34]], columns=["A","B","C","D","E"], index = ["R1","R2","R3"]) # cols use for change header

In [7]:
b

     A   B   C   D   E
R1   1   2   3   4   5
R2  21  12  14  53  23
R3  43   5  75  45  34

In [8]:
b.shape # for knowing rows and cols in dataframe

(3, 5)

In [9]:
c = b.iloc[1,4] # for getting a single element from data of our own choice

In [10]:
c

23

In [11]:
d = b.iloc[1:5,3:5] # for accessing the matrix or data of any other kind of our own choice first one row 2nd is cols value

In [12]:
d

     D   E
R2  53  23
R3  45  34

In [13]:
df1 = pd.DataFrame([[12,2,13], [11,4,65], [12,3,88]], columns=["A","B","C"], index = ["x","y","z"])

In [14]:
df1

    A  B   C
x  12  2  13
y  11  4  65
z  12  3  88

In [15]:
df2 = pd.DataFrame([[12,2,13], [41,3,6], [112,4,45]], columns=["X","Y","Z"], index= ["a", "b","c"])

In [16]:
df2

     X  Y   Z
a   12  2  13
b   41  3   6
c  112  4  45

In [17]:
df3 = pd.merge(df1,df2, right_on="Y", left_on="B") # for merging dataframes in cols

In [18]:
df3

    A  B   C    X  Y   Z
0  12  2  13   12  2  13
1  11  4  65  112  4  45
2  12  3  88   41  3   6

In [19]:
df4 = pd.DataFrame([[1,2,3],[11,4,65],[2,4,5]], columns=["C1","C2","C3"], index=["R1","R2","R3"])

In [20]:
df5 = pd.DataFrame([[23,432,5],[43,67,88],[2,4,5]], columns=["C1","C2","C3"], index=["R1","R2","R3"])

In [21]:
pd.merge(df4,df5, right_index=True, left_index=True)

    C1_x  C2_x  C3_x  C1_y  C2_y  C3_y
R1     1     2     3    23   432     5
R2    11     4    65    43    67    88
R3     2     4     5     2     4     5